fabiangraf96/esp32_webcam/esp32/sdkconfig.defaults
# AI-Thinker ESP32-CAM (classic ESP32, OV2640, 4 MB flash, 4 MB PSRAM).

CONFIG_IDF_TARGET="esp32"

# 4 MB PSRAM used as camera JPEG frame buffer storage.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_FREERTOS_HZ=1000
